#ifndef DIFF_PHRASES
#define DIFF_PHRASES

const char *PHRASES[] = {
    "Несложно заметить, что следующая производная выглядит так:\n",
    "Ежу понятно, что при дальнейшем дифференцирвоании мы получим:\n",
    "Легко заметить, что далее мы получим:\n",
    "Мне уже надоело, но давайте ещё немного посчитаем:\n",
    "Следующие преобразования легко произвести в уме:\n",
    "Легко заметить, что ,продолжая вычисления, получим:\n",
    "Абсолютно очевидно, как найти следующую производную:\n",
    "Ещё разок продифференцируем:\n",
    "Лишняя производная ещё никому не мешала:\n",
    "В который раз дифференцируем:\n",
    "Мне, конечно, кажется, что уже хватит, но давайте ещё разок:\n"
};

const char *SIMPLIFYING[] = {
    "Немного упростим полученный результат:\n",
    "Упростим некоторые части выражения:\n"
};

const char *NUMBER_OF_DERIVIATE[] = {
    "Первая производная:\n",
    "Вторая производная:\n",
    "Третья производная:\n",
    "Четвертая производная:\n",
    "Пятая производная:\n",
};

#endif